Repository: OmChauhan07/AgriConnect
Catalog: lib/l10n/app_*.arb
Languages: gu

# appTitle
source: AgriConnect
gu: એગ્રીકનેક્ટ

# welcome
source: Welcome to AgriConnect
gu: એગ્રીકનેક્ટમાં આપનું સ્વાગત છે

source: Language
gu: ભાષા

source: Home
gu: હોમ

source: About
gu: અમારા વિશે

source: Contact
gu: સંપર્ક

source: Change Language
gu: ભાષા બદલો

source: Products
gu: ઉત્પાદો

source: Orders
gu: ઓર્ડર્સ

source: Profile
gu: પ્રોફાઇલ

source: Settings
gu: સેટિંગ્સ

source: Cart
gu: કાર્ટ

source: Checkout
gu: ચેકઆઉટ

source: Login
gu: લોગિન

source: Sign Up
gu: સાઇન અપ

source: Logout
gu: લોગઆઉટ

source: Search
gu: શોધ

source: Organic
gu: જૈવિક

source: ADD TO CART
gu: કાર્ટમાં ઉમેરો

source: Buy Now
gu: અત્યારે ખરીદો

source: View Details
gu: વિગતો જુઓ

source: Quantity
gu: જથ્થો

source: Price
gu: કિંમત

source: Total
gu: કુલ

source: Continue
gu: ચાલુ રાખો

source: Place Order
gu: ઓર્ડર કરો

# orderSuccess
source: Order Placed Successfully
gu: ઓર્ડર સફળતાપૂર્વક કરાયો

source: Order History
gu: ઓર્ડર ઇતિહાસ

source: My Account
gu: મારું એકાઉન્ટ

source: Edit Profile
gu: પ્રોફાઇલ એડિટ કરો

source: Name
gu: નામ

source: Email
gu: ઇમેઇલ

source: Phone
gu: ફોન

source: Address
gu: સરનામું

source: Save
gu: સેવ કરો

source: Cancel
gu: રદ કરો

# chooseRole
source: Choose your role
gu: તમારી ભૂમિકા પસંદ કરો

source: Farmer
gu: ખેડૂત

source: Consumer
gu: ગ્રાહક

source: Username
gu: વપરાશકર્તા નામ

source: Password
gu: પાસવર્ડ

source: Confirm Password
gu: પાસવર્ડની પુષ્ટિ કરો

# dontHaveAccount
source: Don't have an account?
gu: ખાતું નથી?

# alreadyHaveAccount
source: Already have an account?
gu: પહેલેથી જ ખાતું છે?

source: Register
gu: રજીસ્ટર કરો

source: Add Product
gu: ઉત્પાદ ઉમેરો

source: Manage Products
gu: ઉત્પાદનો સંચાલિત કરો

source: Manage Orders
gu: ઓર્ડર સંચાલિત કરો

source: Farm Profile
gu: ફાર્મ પ્રોફાઇલ

source: Product Name
gu: ઉત્પાદન નામ

source: Product Type
gu: ઉત્પાદન પ્રકાર

# productPrice
source: Price
gu: કિંમત

# productQuantity
source: Quantity
gu: જથ્થો

# productDescription
source: Description
gu: વર્ણન

source: Farming Method
gu: ખેતી પદ્ધતિ

# generateQR
source: Generate QR Code
gu: QR કોડ જનરેટ કરો

source: Organic Certified
gu: જૈવિક પ્રમાણિત

# scan
source: Scan QR
gu: QR સ્કેન કરો

source: Marketplace
gu: માર્કેટપ્લેસ

source: Total Amount
gu: કુલ રકમ

source: Search products...
gu: ઉત્પાદનો શોધો...

source: Verify Product
gu: ઉત્પાદન ચકાસો

source: Notifications
gu: નોટિફિકેશન્સ

source: Delete
gu: કાઢી નાખો

source: Edit
gu: સંપાદિત કરો

# enterEmail
source: Enter your email
gu: તમારું ઇમેઇલ દાખલ કરો

# enterPassword
source: Enter your password
gu: તમારો પાસવર્ડ દાખલ કરો

# pleaseEnterEmail
source: Please enter your email
gu: કૃપા કરી તમારું ઇમેઇલ દાખલ કરો

# pleaseEnterValidEmail
source: Please enter a valid email
gu: કૃપા કરી માન્ય ઇમેઇલ દાખલ કરો

# pleaseEnterPassword
source: Please enter your password
gu: કૃપા કરી તમારો પાસવર્ડ દાખલ કરો

# passwordMinLength
source: Password must be at least 6 characters
gu: પાસવર્ડ ઓછામાં ઓછા 6 અક્ષરનો હોવો જોઈએ

source: Forgot Password?
gu: પાસવર્ડ ભૂલી ગયા?

# forgotPasswordNotImplemented
source: Forgot password not implemented in prototype
gu: પ્રોટોટાઇપમાં પાસવર્ડ ભૂલી ગયા ફીચર લાગુ કરવામાં આવ્યું નથી

# invalidCredentials
source: Invalid email or password
gu: અમાન્ય ઇમેઇલ અથવા પાસવર્ડ

# errorOccurred
source: An error occurred
gu: એક ભૂલ થઈ

# farming_organic
source: Organic
gu: જૈવિક

# farming_natural
source: Natural
gu: કુદરતી

# farming_conventional
source: Conventional
gu: પરંપરાગત

# farming_hydroponic
source: Hydroponic
gu: હાઇડ્રોપોનિક

# searchHint
source: Search for products...
gu: ઉત્પાદો માટે શોધો...

source: Phone Number
gu: ફોન નંબર

source: User Type
gu: વપરાશકર્તા પ્રકાર

# invalidEmail
source: Please enter a valid email address
gu: કૃપા કરીને માન્ય ઈમેલ એડ્રેસ દાખલ કરો

# passwordTooShort
source: Password must be at least 6 characters
gu: પાસવર્ડ ઓછામાં ઓછા 6 અક્ષરનો હોવો જોઈએ

source: Passwords do not match
gu: પાસવર્ડ મેળ ખાતા નથી

# pleaseEnterName
source: Please enter your name
gu: કૃપા કરીને તમારું નામ દાખલ કરો

source: Welcome Back
gu: પાછા આવવા પર સ્વાગત છે

source: Sign in to continue
gu: ચાલુ રાખવા માટે સાઇન ઇન કરો

# createAccount
source: Create an Account
gu: ખાતું બનાવો

# fillDetails
source: Fill in your details to get started
gu: શરૂ કરવા માટે તમારી વિગતો ભરો

source: Get Started
gu: શરૂ કરો

source: Continue as Guest
gu: મહેમાન તરીકે ચાલુ રાખો

source: Categories
gu: શ્રેણીઓ

source: Explore Categories
gu: શ્રેણીઓ શોધો

source: View All
gu: બધું જુઓ

source: Top Rated
gu: ટોપ રેટેડ

source: Nearby Farmers
gu: નજીકના ખેડૂતો

source: Recently Added
gu: તાજેતરમાં ઉમેરવામાં આવ્યું

source: Farmers
gu: ખેડૂતો

source: Dashboard
gu: ડેશબોર્ડ

source: My Products
gu: મારા ઉત્પાદો

source: My Orders
gu: મારા ઓર્ડર્સ

# fruitVegetables
source: Fruits & Vegetables
gu: ફળો અને શાકભાજી

source: Dairy
gu: ડેરી

source: Grains
gu: અનાજ

# herbs
source: Herbs & Spices
gu: જડીબુટ્ટી અને મસાલા

source: Other
gu: અન્ય

source: English
gu: અંગ્રેજી

source: Hindi
gu: હિન્દી

source: Gujarati
gu: ગુજરાતી

source: Dark Mode
gu: ડાર્ક મોડ

# accountInfo
source: Account Information
gu: ખાતાની માહિતી

source: Help & Support
gu: મદદ અને સમર્થન

source: Terms & Conditions
gu: નિયમો અને શરતો

source: Privacy Policy
gu: ગોપનીયતા નીતિ

# version
source: Version {number}
gu: સંસ્કરણ {number}

source: Loading...
gu: લોડ થઈ રહ્યું છે...

source: Error
gu: ભૂલ

source: No results found
gu: કોઈ પરિણામ મળ્યું નથી

# tryDifferentSearch
source: Try a different search term
gu: અલગ શોધ શબ્દ અજમાવો

# authFailed
source: Authentication failed: {message}
gu: પ્રમાણીકરણ નિષ્ફળ: {message}

# networkError
source: Network error. Please check your connection
gu: નેટવર્ક ભૂલ. કૃપા કરીને તમારું કનેક્શન તપાસો

source: Something went wrong
gu: કંઈક ખોટું થયું

source: Try Again
gu: ફરી પ્રયાસ કરો

source: Product Details
gu: ઉત્પાદ વિગતો

source: per {unit}
gu: પ્રતિ {unit}

source: Rating
gu: રેટિંગ

source: Verified
gu: ચકાસાયેલ

source: View Profile
gu: પ્રોફાઇલ જુઓ

source: Description
gu: વર્ણન

source: Product Verified
gu: ઉત્પાદન ચકાસાયેલ છે

# productVerifiedDescription
source: This product has been verified for authenticity and traceability. You can trust its origin and quality.
gu: આ ઉત્પાદન પ્રામાણિકતા અને ટ્રેસેબિલિટી માટે ચકાસાયેલ છે. તમે તેના ઉદ્ભવ અને ગુણવત્તા પર વિશ્વાસ કરી શકો છો.

# availableQuantity
source: Available: {quantity} {unit}
gu: ઉપલબ્ધ: {quantity} {unit}

source: Total Price:
gu: કુલ કિંમત:

# invalidQuantity
source: Invalid quantity selected
gu: અમાન્ય જથ્થો પસંદ કરેલ છે

# addedToCart
source: {product} added to cart
gu: {product} કાર્ટમાં ઉમેરાયું

source: VIEW CART
gu: કાર્ટ જુઓ

source: About Farm
gu: ફાર્મ વિશે

source: No description available
gu: કોઈ વર્ણન ઉપલબ્ધ નથી

source: Contact Information
gu: સંપર્ક માહિતી

# featureNotAvailable
source: Feature not available in prototype
gu: આ સુવિધા પ્રોટોટાઇપમાં ઉપલબ્ધ નથી

source: View All Products
gu: બધા ઉત્પાદો જુઓ

source: Farmer Dashboard
gu: ખેડૂત ડેશબોર્ડ

source: Order Statistics
gu: ઓર્ડર આંકડા

source: Total Orders
gu: કુલ ઓર્ડર્સ

source: Pending
gu: બાકી

source: Delivered
gu: પહોંચાડાયેલ

source: Sales Overview
gu: વેચાણ ઝલક

# salesChartPlaceholder
source: Sales chart will be displayed here
gu: વેચાણ ચાર્ટ અહીં દર્શાવવામાં આવશે

source: Your Products
gu: તમારા ઉત્પાદો

source: Add New
gu: નવું ઉમેરો

# noProductsYet
source: No products added yet
gu: હજી સુધી કોઈ ઉત્પાદો ઉમેરાયા નથી

# tapAddProductToStart
source: Tap the + button to add your first product
gu: તમારો પ્રથમ ઉત્પાદ ઉમેરવા માટે + બટન પર ટેપ કરો

source: Close
gu: બંધ કરો

source: Featured Farmers
gu: ફીચર્ડ ખેડૂતો

source: All Products
gu: બધા ઉત્પાદો

source: Search Results
gu: શોધ પરિણામો

source: Current Language
gu: વર્તમાન ભાષા

source: Select Language
gu: ભાષા પસંદ કરો

source: Translation Settings
gu: અનુવાદ સેટિંગ્સ

source: Auto-translate content
gu: સામગ્રીનું સ્વત: અનુવાદ કરો

# autoTranslateDescription
source: Automatically translate product details and descriptions to your preferred language
gu: ઉત્પાદન વિગતો અને વર્ણનોનું તમારી પસંદગીની ભાષામાં આપોઆપ અનુવાદ કરો

# translationDisclaimer
source: Machine translation may not be 100% accurate. Original text is always available.
gu: મશીન અનુવાદ 100% સચોટ ન હોઈ શકે. મૂળ ટેક્સ્ટ હંમેશા ઉપલબ્ધ છે.

# translationEnabled
source: Auto-translation enabled. Content will be translated.
gu: સ્વત:-અનુવાદ સક્ષમ. સામગ્રીનો અનુવાદ કરવામાં આવશે.

# translationDisabled
source: Auto-translation disabled. Original text will be shown.
gu: સ્વત:-અનુવાદ અક્ષમ. મૂળ ટેક્સ્ટ દેખાશે.

# profileUpdated
source: Profile updated successfully
gu: પ્રોફાઇલ સફળતાપૂર્વક અપડેટ થઈ

# profileUpdateError
source: Error updating profile
gu: પ્રોફાઇલ અપડેટ કરવામાં ભૂલ

# profileImageUpdated
source: Profile image updated successfully
gu: પ્રોફાઇલ ઇમેજ સફળતાપૂર્વક અપડેટ થઈ

# profileImageUpdateError
source: Error updating profile image
gu: પ્રોફાઇલ ઇમેજ અપડેટ કરવામાં ભૂલ

# farmName
source: Farm/Farmer Name
gu: ફાર્મ/ખેડૂતનું નામ

source: Farm Address
gu: ફાર્મનું સરનામું

source: Farm Description
gu: ફાર્મનું વર્ણન

# pleaseEnterPhone
source: Please enter your phone number
gu: કૃપા કરીને તમારો ફોન નંબર દાખલ કરો

# pleaseEnterAddress
source: Please enter your farm address
gu: કૃપા કરીને તમારા ફાર્મનું સરનામું દાખલ કરો

# pleaseEnterDescription
source: Please enter your farm description
gu: કૃપા કરીને તમારા ફાર્મનું વર્ણન દાખલ કરો

source: Farming Certifications
gu: ખેતી પ્રમાણપત્રો

source: Organic Certification
gu: જૈવિક પ્રમાણપત્ર

# tapToAddCertification
source: Tap to add your organic farming certification
gu: તમારું જૈવિક ખેતી પ્રમાણપત્ર ઉમેરવા માટે ટેપ કરો

source: Personal Information
gu: વ્યક્તિગત માહિતી

source: Not provided
gu: આપેલ નથી

source: Recent Orders
gu: તાજેતરના ઓર્ડર

# noOrdersYet
source: No orders yet. Start shopping!
gu: હજી સુધી કોઈ ઓર્ડર નથી. શોપિંગ શરૂ કરો!

source: View All Orders
gu: બધા ઓર્ડર જુઓ

source: App Settings
gu: એપ સેટિંગ્સ

source: Enabled
gu: સક્રિય

source: Completed
gu: પૂર્ણ થયું

source: In Progress
gu: પ્રગતિમાં છે

source: Active
gu: સક્રિય

source: Accepted
gu: સ્વીકૃત

source: Rejected
gu: અસ્વીકૃત

source: Shipped
gu: મોકલી દીધું છે

source: Cancelled
gu: રદ કરેલ છે

source: Order
gu: ઓર્ડર

source: Order Date
gu: ઓર્ડર તારીખ

source: Delivery Address
gu: ડિલિવરી સરનામું

source: Order Items
gu: ઓર્ડર આઇટમ્સ

source: Unknown Product
gu: અજ્ઞાત ઉત્પાદન

source: No pending orders
gu: કોઈ બાકી ઓર્ડર નથી

source: No active orders
gu: કોઈ સક્રિય ઓર્ડર નથી

source: No completed orders
gu: કોઈ પૂર્ણ ઓર્ડર નથી

# orderStatusUpdated
source: Order status updated to
gu: ઓર્ડર સ્ટેટસ અપડેટ થયો

# failedToUpdateStatus
source: Failed to update order status
gu: સ્ટેટસ અપડેટ કરવામાં નિષ્ફળ

source: Mark as Shipped
gu: મોકલેલ તરીકે માર્ક કરો

source: Mark as Delivered
gu: ડિલિવર થયેલ તરીકે માર્ક કરો

source: Accept
gu: સ્વીકારો

source: Reject
gu: અસ્વીકાર કરો

source: Your Cart
gu: તમારી કાર્ટ

source: Clear Cart
gu: કાર્ટ ખાલી કરો

# clearCartConfirmation
source: Are you sure you want to clear your cart?
gu: શું તમે ખરેખર તમારી કાર્ટ ખાલી કરવા માંગો છો?

source: Clear
gu: ખાલી કરો

# cartEmpty
source: Your cart is empty
gu: તમારી કાર્ટ ખાલી છે

# addProductsToCart
source: Add some products to your cart
gu: તમારી કાર્ટમાં કેટલાક ઉત્પાદનો ઉમેરો

source: Browse Products
gu: ઉત્પાદનો બ્રાઉઝ કરો

source: Subtotal
gu: પેટા કુલ

source: Delivery Fee
gu: ડિલિવરી ફી

source: Proceed to Checkout
gu: ચેકઆઉટ કરો

# enterDeliveryAddress
source: Enter your delivery address
gu: તમારું ડિલિવરી સરનામું દાખલ કરો

# orderNotes
source: Order Notes (Optional)
gu: ઓર્ડર નોંધ (વૈકલ્પિક)

# specialDeliveryInstructions
source: Any special instructions for delivery
gu: ડિલિવરી માટે કોઈ ખાસ સૂચનાઓ

source: Payment Method
gu: ચુકવણી પદ્ધતિ

source: Cash on Delivery
gu: ડિલિવરી પર રોકડ

source: Order Placed!
gu: ઓર્ડર મૂકાયો!

# orderPlacedSuccessfully
source: Your order has been placed successfully. You can track your order status in the Orders section.
gu: તમારો ઓર્ડર સફળતાપૂર્વક મૂકવામાં આવ્યો છે. તમે ઓર્ડર વિભાગમાં તમારા ઓર્ડરની સ્થિતિને ટ્રૅક કરી શકો છો.

source: OK
gu: ઠીક છે

# orderPlaceFailed
source: Failed to place order. Please try again.
gu: ઓર્ડર મૂકવામાં નિષ્ફળ. કૃપા કરીને ફરી પ્રયાસ કરો.

# languageChanged
source: Language has been changed
gu: ભાષા બદલાઈ ગઈ છે

source: Loading products...
gu: પ્રોડક્ટ્સ લોડ થઈ રહ્યાં છે...
